"AWAY_LOCK_LABEL" = "avaa";
"AWAY_LOCK_LABEL_SHORT" = "avaa";
"AWAY_LOCK_LABEL_FORMAT" = "%@";
"AWAY_LOCK_EMERGENCY_LABEL" = "Hätäpuhelu";
"AWAY_LOCK_BUDDY_LABEL" = "ota käyttöön";
"AWAY_SMS_LABEL" = "Tekstiviesti";
"AWAY_MISSED_CALL_LABEL" = "Vastaamaton";
"AWAY_MISSED_VOICEMAIL_LABEL" = "Puheposti";
"VOICEMAIL_AVAILABLE" = "Puheposti käytettävissä";
"AWAY_EMPTY_CALL" = "Tuntematon";
"AWAY_EMPTY_SMS" = "Tuntematon";
"AWAY_EMPTY_VM" = "Tuntematon";
"AWAY_CALENDAR_LABEL" = "Tapahtuma";
"REMOTE_NOTIFICATIONS_LOCK_FORMAT" = "%@";
"REMOTE_NOTIFICATIONS_LOCK_LABEL" = "katso";
"DISMISS_ALERT" = "OK";
"DONE" = "Valmis";
"REPLY" = "Vastaa";
"REDIAL" = "Valitse uudelleen";
"ACCEPT" = "Hyväksy";
"SMS_READ" = "Lue";
"SMS_ALERT_TITLE" = "Tekstiviesti";
"SLIDE_TO_ANSWER" = "vastaa";
"POWER_DOWN_LINE_1" = "sammuta pitämällä";
"POWER_DOWN_LINE_2" = "painiketta painettuna";
"PIN_LOCKED_STRING" = "SIM-kortti on lukittu. Haluatko avata sen?";
"UNLOCK" = "Avaa";
"IPOD_ONLY" = "iPod";

"NEW_VOICEMAIL" = "Uusi puheposti";
"NEW_VOICEMAIL_BODY" = "Puheposti";
"NEW_VOICEMAIL_FROM" = "Uusi puheposti henkilöltä %@";
"SLIDE_TO_LISTEN" = "kuuntele";
"LISTEN" = "Kuuntele";

"CALLING" = "soitetaan…";
"CALLING_LABEL_FORMAT" = "soitetaan… - %@";

"SLIDE_TO_CALL_BACK" = "soita takaisin";
"SLIDE_TO_CALL_BACK_SHORT" = "Soita";
"CALL_BACK" = "Soita takaisin";
"CALL_FAILURE" = "Puhelu epäonnistui";
"CALL_WITH" = "Soita %@: %@";

"PIN_LOCKED_TITLE" = "SIM-kortti lukittu";
"ENTER_PIN_TITLE" = "Syötä PIN-koodi";
"PIN_ATTEMPT_REMAINING" = "1 yritys jäljellä";
"PIN_ATTEMPTS_REMAINING" = "%@ yritystä jäljellä";
"WAITING_RESPONSE_TITLE" = "Avataan…";
"WAIT_FOR_UNLOCK" = "odota";
"PIN_UNLOCK_FAILED_TITLE" = "Virheellinen PIN-koodi";

"PUK_LOCKED_TITLE" = "PUK-koodilla lukittu";
"ENTER_PUK_TITLE" = "Syötä PUK-koodi";
"PUK_LOCKED_STRING" = "SIM-korttia ei voida käyttää. Pyydä operaattorilta PUK-koodi.";
"PUK_LOCKED_ENTER_PIN" = "Syötä PIN-koodi";
"PUK_LOCKED_ENTER_PIN_LABEL" = "valitse uusi PIN-koodi";
"PUK_LOCKED_CONFIRM_PIN" = "Vahvista uusi PIN-koodi";
"PUK_LOCKED_CONFIRM_PIN_LABEL" = "syötä uusi PIN-koodi uudelleen";
"PUK_UNLOCK_FAILED_TITLE" = "Virheellinen PUK-koodi";
"PUK_LOCKED_PIN_MISMATCH_LABEL" = "aiemmat koodit eivät täsmänneet";
"BRICKED_AND_SIM_LOCKED_STRING_IPHONE" = "Aktivoi iPhone syöttämällä sopiva SIM ilman PIN-lukitusta.";
"BRICKED_AND_SIM_LOCKED_STRING_IPAD" = "Aktivoi iPad syöttämällä sopiva SIM ilman PIN-lukitusta.";
"PUK_HOPELESSLY_LOCKED_TITLE" = "PUK-koodi lukittu";
"PUK_HOPELESSLY_LOCKED_STRING" = "Kaikki SIM-kortin avaamisyritykset on käytetty. Ota yhteyttä operaattoriin.";

"MISSING_SIM_TITLE" = "SIM-korttia ei ole asennettu";
"LOCKED_SIM_TITLE" = "Virheellinen SIM-kortti";

"PERSONALIZATION_LOCK_ENTER_CODE" = "Syötä koodi";
"PERSONALIZATION_UNLOCK_FAILED_TITLE" = "Virheellinen koodi";

"NETWORK_LOCKED_LABEL" = "verkon rajoitus";
"OPERATOR_LOCKED_LABEL" = "operaattorin rajoitus";
"OPERATOR_SS_LOCKED_LABEL" = "operaattorin lisärajoitus";
"CORPORATE_LOCKED_LABEL" = "yrityksen rajoitus";
"SERVICE_PROVIDER_LOCKED_LABEL" = "palveluntarjoajan räätälöinti";

"PERSONALIZATION_LOCKED_SIM_STRING" = "Tätä iPhonea täytyy käyttää hyväksytyllä SIM-kortilla.";

"NETWORK_LOCKED_SIM_STRING" = "Puhelin on sidottu tiettyyn SIM-korttiin.";
"OPERATOR_LOCKED_SIM_STRING" = "Puhelin on sidottu tietyn operaattorin SIM-kortteihin.";
"OPERATOR_SUBSET_LOCKED_SIM_STRING" = "Puhelin on sidottu tietyn operaattorin tiettyihin SIM-kortteihin.";
"CORPORATE_LOCKED_SIM_STRING" = "Puhelin on sidottu tiettyihin yrityksen SIM-kortteihin.";
"SERVICE_PROVIDER_LOCKED_SIM_STRING" = "Puhelin on sidottu tietyn palveluntarjoajan SIM-kortteihin.";

"DURATION_PREAMBLE" = "Palaa puheluun koskettamalla";
"PLEASE_WAIT" = "Odota…";
"BAD_SIM_TITLE" = "SIM-kortin virhe";
"BAD_SIM_STRING" = "SIM-kortti täytyy vaihtaa.  Ota yhteyttä palveluntarjoajaan.";
"CHARS_REMAINING" = "%@ merkkiä jäljellä";
"CHAR_REMAINING" = "%@ merkki jäljellä";
"UNKNOWN" = "Tuntematon";
"BLOCKED" = "Estetty";
"CANCEL" = "Kumoa";
"BACK" = "Takaisin";
"SEND" = "Lähetä";
"YES" = "Kyllä";
"NO" = "Ei";
"NEW_TEXT_MESSAGE" = "Uusi tekstiviesti";

"VIEW" = "Näytä";
"CLOSE" = "Sulje";
"POWER_DOWN_LOCK_LABEL" = "sammuta";
"POWER_DOWN_CANCEL" = "Kumoa";
"DIAL" = "Valitse";
"NO_SERVICE" = "Ei verkkoa";
"SEARCHING" = "Etsitään…";
"SOS_ONLY" = "Vain SOS";
"NO_SIM" = "Ei SIM-korttia";
"BAD_SIM" = "Virheellinen SIM-kortti";
"LOCKED_SIM" = "SIM-kortti lukittu";
"MULTIPLE_CALLS" = "Useita puheluja";
"CONFERENCE_CALL" = "Neuvottelu";

"Call Failure\n%@\n%@" = "Puhelu epäonnistui\n%@\n%@";

"MOBILITY_MANAGEMENT_FORMAT_STRING" = "MM #%d";
"Smart chip not provisioned" = "SIM-korttia ei asennettu";
"Smart chip not allowed" = "SIM-kortti ei sallittu";
"Call failed" = "Puhelu epäonnistui";
"Phone not allowed" = "Puhelin ei sallittu";

"FIXED_DIALING_LOCKED_SIM_TITLE" = "Soitonrajoitus päällä";
"FIXED_DIALING_LOCKED_SIM_STRING" = "SIM-kortissasi on soitonrajoitus.  Voit soittaa vain hätäpuheluja.";

"TTY (No SIM)" = "TTY (Ei SIM-korttia)";
"TTY" = "TTY";
"USE_TTY_FOR_CALL" = "Käytä TTY:tä puheluun?";

"ENTER_PASSCODE" = "Syötä pääsykoodi";
"WRONG_PASSCODE" = "Virheellinen pääsykoodi";
"TRY_AGAIN" = "yritä uudelleen";
"DEVICE_BLOCKED" = "%@ on pois käytöstä";
"EMERGENCY_CALL" = "Hätäpuhelu";
"EMERGENCY_CALL_TITLE" = "Hätä-\npuhelu";
"CONNECT_TO_ITUNES" = "yhdistä iTunesiin";
"ONE_MINUTE_TO_UNBLOCK" = "yritä uudelleen minuutin päästä";
"MULTIPLE_MINUTES_TO_UNBLOCK" = "yritä uudelleen %@ min. päästä";

"ALPHANUMERIC_PASSCODE_OK" = "OK";
"ALPHANUMERIC_PASSCODE_CANCEL" = "Kumoa";

"VOD_OK" = "OK";

"LOCAL_NOTIFICATION_SNOOZE" = "Torkku";

"LOW_BATT_TITLE" = "Akku vähissä";
"LOW_BATT_MSG_LEVEL" = "Akun varausta jäljellä %@";

"AUTO_WIFI_SYNC_LOW_POWER" = "iTunesin automaattinen Wi-Fi-synkronointi jatkuu, kun ladattu.";
"AUTO_WLAN_SYNC_LOW_POWER" = "iTunesin automaattinen WLAN-synkronointi jatkuu, kun ladattu.";
"WIFI_SYNC_LOW_POWER" = "iTunesin Wi-Fi-synkronointi jatkuu, kun ladattu.";
"WLAN_SYNC_LOW_POWER" = "iTunesin WLAN-synkronointi jatkuu, kun ladattu.";
"SYNC_LOW_POWER" = "iTunesin synkronointi jatkuu, kun ladattu.";

"NETWORK_LOST" = "Verkko menetettiin";
"NETWORK_RESTRICTED" = "Rajoitettu verkko";
"SETTINGS" = "Asetukset";
"NETWORK_LOST_TEXT" = "Valittu mobiiliverkko ei ole enää käytettävissä. Valitse toinen verkko asetuksista.";
"NETWORK_RESTRICTED_TEXT" = "Valittu mobiiliverkko on rajoitettu. Valitse toinen verkko asetuksista.";
"NETWORK_LOST_LOCK_LABEL" = "valitse";
"NETWORK_LOST_LOCK_LABEL_SHORT" = "valitse";

"CALL" = "Soita";

"OK" = "OK";

"TIMER_LOCK_LABEL" = "pysäytä ajastin";
"COUNT_DOWN_TIME_REACHED" = "Ajastin valmis";

"LOW_DISK_SPACE_TITLE" = "Tallennustila melkein täynnä";
"LOW_DISK_SPACE_MESSAGE" = "Voit hallita tallennustilaa Asetuksissa.";
"LOW_DISK_SPACE_DISMISS" = "Valmis";
"LOW_DISK_SPACE_SETTINGS" = "Asetukset";

"DEAD_RADIO_TITLE" = "Palautus tarvitaan";
"DEAD_RADIO_MESSAGE" = "iPhonella ei voida soittaa tai vastaanottaa puheluja.\nPalauta iTunesista. www.apple.com/fi/support";

"DEVICE_INACTIVE" = "Aktivoi iPhone";
"ACTIVATION_REQUIRED" = "Aktivointi vaaditaan";
"PHONE_ACTIVATED" = "iPhone on aktivoitu";
"WAITING_FOR_ACTIVATION_TITLE" = "Odotetaan aktivointia";
"WAITING_FOR_ACTIVATION_BODY" = "Tämä kestää hetken.";
"ACTIVATION_FAILED_TITLE" = "iPhonea ei ole aktivoitu";
"ACTIVATION_FAILED_BODY" = "Jos ongelma jatkuu, ota yhteyttä operaattoriin.";
"ACTIVATION_FAILED_BODY_SUPPORT" = "Jos ongelma jatkuu, ota yhteyttä operaattoriin (%@) toisella puhelimella.";
"ACTIVATION_FAILED_IGNORE_BUTTON" = "Ohita";
"ACTIVATION_FAILED_RETRY_BUTTON" = "Uudelleen";
"MISMATCHED_SIM_TITLE" = "Toinen SIM tunnistettu";
"MISMATCHED_SIM_BODY" = "Yhdistä iTunesiin";
"REGISTRATION_FAILED_TITLE" = "Aktivointivaroitus";
"REGISTRATION_FAILED_BODY" = "Signaalia ei havaita. Signaali vaaditaan aktivoinnin päättämiseksi.";

"CALL_FORWARDING_ACTIVE" = "Soitonsiirto käytössä";
"OUTGOING_CALL_FORWARDED" = "Lähtevä puhelu siirretty";
"INCOMING_CALL_FORWARDED" = "Saapuva puhelu siirretty";

"AIRPLANE_DATA_PROMPT" = "Poista lentokonetila käytöstä tai käytä Wi-Fiä datan käyttämiseen";
"AIRPLANE_DATA_PROMPT_WLAN" = "Poista lentokonetila käytöstä tai käytä WLANia datan käyttämiseen";
"AIRPLANE_DATA_PROMPT_NO_WIFI" = "Käytä dataa poistumalla lentokonetilasta";
"AIRPLANE_DATA_OK" = "OK";
"AIRPLANE_DATA_SETTINGS" = "Asetukset";
"AIRPLANE_CELL_PROMPT" = "Voit käyttää dataa poistumalla lentokonetilasta.";
"AIRPLANE_CELL_PROMPT_SMS" = "Ota lentokonetila pois käytöstä viestien lähettämiseksi tai vastaanottamiseksi.";

"IN_CALL_LAUNCH_ALERT" = "Mobiilidatayhteydet eivät ole käytettävissä tämän puhelun aikana.";
"IN_CALL_LAUNCH_OK" = "OK";

"PIN_ENTRY_SUCCESS" = "PIN-koodi oikein";
"PUK_ENTRY_SUCCESS" = "PUK-koodin syöttö onnistui";

"SLIDE_TO_CANCEL" = "kumoa";

"RESTORE_IN_PROGRESS" = "Palautus käynnissä";
"RESTORE_COMPLETE" = "Palautus valmis";
"RESTORE_FAILED" = "Palautus epäonnistui";

"RESTORE_FAILURE_ALERT_RESTART_BUTTON_TITLE" = "Käynnistä uudelleen";
"RESTORE_FAILURE_ALERT_BODY_TEXT" = "Palautuksessa on havaittu ongelma. Käynnistä %@ uudelleen ja yritä palauttaa uudelleen.";

"RESET_IN_PROGRESS" = "Nollataan %@";
"RESET_COMPLETE" = "Nollaus suoritettu";

"NO_NAME" = "Tuntematon";

"HEADSET_VOLUME" = "kuulokemikrofoni";
"BLUETOOTH_VOLUME" = "Bluetooth";
"RINGER_VOLUME" = "soittovoimakkuus";
"SOUND_EFFECTS_VOLUME" = "äänitehosteet";
"VOLUME" = "voimakkuus";
"HEADPHONES" = "kuulokkeet";
"VOLUME_HUD_FORMAT" = "(%@)";

"RE-CALIBRATE COMPASS" = "Kompassihäiriö";
"RE-CALIBRATE_INSTRUCTION_IPHONE" = "Poistu häiriön luota tai kalibroi\nuudelleen heiluttamalla iPhonea kahdeksikon muodossa.";
"RE-CALIBRATE_INSTRUCTION_IPOD" = "Poistu häiriön luota tai kalibroi\nuudelleen heiluttamalla iPodia kahdeksikon muodossa.";
"RE-CALIBRATE_INSTRUCTION_IPAD" = "Poistu häiriön luota tai kalibroi\nuudelleen heiluttamalla iPadia kahdeksikon muodossa.";

"EDGE_FAILURE" = "Mobiilidataverkkoa ei voitu aktivoida";
"EDGE_FAILURE_SETTINGS" = "Asetukset";  
"EDGE_ROAMING_FAILURE_TITLE" = "Data roaming pois päältä";
"EDGE_ROAMING_FAILURE_BODY" = "Käytä Wi-Fiä tai ota data roaming käyttöön kohdasta Asetukset > Yleiset > Verkko. Saattaa olla maksullinen.";
"EDGE_ROAMING_FAILURE_BODY_WLAN" = "Käytä WLANia tai ota data roaming käyttöön kohdasta Asetukset > Yleiset > Verkko. Voi olla maksullista.";
"EDGE_ROAMING_FAILURE_BODY_NO_WIFI" = "Ota data roaming käyttöön kohdasta Asetukset > Yleiset > Verkko. Saattaa olla maksullinen.";
"EDGE_ROAMING_FAILURE_BODY_IPAD" = "Käytä Wi-Fiä tai ota data roaming käyttöön kohdasta Asetukset > Mobiilidata. Saattaa olla maksullinen.";
"EDGE_ROAMING_FAILURE_BODY_IPAD_WLAN" = "Käytä WLANia tai ota data roaming käyttöön kohdasta Asetukset > Mobiilidata. Voi olla maksullista.";
"EDGE_ROAMING_FAILURE_BODY_IPAD_NO_WIFI" = "Ota data roaming käyttöön kohdasta Asetukset > Mobiilidata. Saattaa olla maksullinen.";
"EDGE_OFF_FAILURE_TITLE" = "Mobiilidata pois päältä";
"EDGE_OFF_FAILURE_BODY" = "Voit käyttää dataa laittamalla mobiilidatan päälle tai käyttämällä Wi-Fiä.";
"EDGE_OFF_FAILURE_BODY_WLAN" = "Voit käyttää dataa laittamalla mobiilidatan päälle tai käyttämällä WLANia";
"EDGE_OFF_FAILURE_BODY_NO_WIFI" = "Voit käyttää dataa laittamalla mobiilidatan päälle.";
"EDGE_OFF_FAILURE_BODY_IPAD" = "Voit käyttää dataa laittamalla mobiilidatan päälle tai käyttämällä Wi-Fiä.";
"EDGE_OFF_FAILURE_BODY_IPAD_WLAN" = "Voit käyttää dataa laittamalla mobiilidatan päälle tai käyttämällä WLANia";
"EDGE_OFF_FAILURE_BODY_IPAD_NO_WIFI" = "Voit käyttää dataa laittamalla mobiilidatan päälle.";
"EDGE_OK" = "OK";

"kGprsIllegalMs" = "Virheellinen MS";
"kGprsIllegalMe" = "Virheellinen ME";
"kGprsServicesNotAllowed" = "GPRS-palvelut eivät ole sallittuja";
"kGprsPlmnNotAllowed" = "PLMN ei sallittu";
"kGprsLocationAreaNotAllowed" = "Sijaintialue ei sallittu";
"kGprsRoamingNotAllowedInLocationArea" = "Verkkovierailu on kielletty tällä alueella";
"kGprsServiceOptionNotSupported" = "Valittua palvelua ei tueta";
"kGprsServiceOptionNotSubscribed" = "Et ole tilannut mobiilidatapalvelua";
"kGprsServiceOptionTemporarilyOutOfOrder" = "Mobiilidataverkko ei ole käytettävissä";
"kGprsPdpAuthenticationFailure" = "PDP-todentamisvirhe";
"kGprsInvalidMobileClass" = "Virheellinen mobiililuokka";

"IPOD" = "iPod";
"MUSIC" = "Musiikki";

"SETTING_LANGUAGE" = "Valitaan kieltä…";
// Localized device name capabilities
"iPod" = "iPod";
"iPad" = "iPad";
"iPhone" = "iPhone";

"EXPIRED_FORMAT" = "Vuokrajakso kohteelle ”%@” on päättynyt";
"WARNING_DAYS_FORMAT" = "Sinulla on %@ päivää aikaa katsoa %@ jonka jälkeen se poistetaan";
"WARNING_DAY_FORMAT" = "Sinulla on %@ päivä aikaa katsoa %@ jonka jälkeen se poistetaan";
"WARNING_HOURS_FORMAT" = "Sinulla on %@ tuntia aikaa katsoa %@ jonka jälkeen se poistetaan";
"WARNING_HOUR_FORMAT" = "Sinulla on %@ tunti aikaa katsoa %@ jonka jälkeen se poistetaan";
"WARNING_MINUTES_FORMAT" = "Sinulla on %@ minuuttia aikaa katsoa %@ jonka jälkeen se poistetaan";
"WARNING_MINUTE_FORMAT" = "Sinulla on %@ minuutti aikaa katsoa %@ jonka jälkeen se poistetaan";

"NEWSSTAND_ICON_TITLE" = "Lehtikioski";
"NEWSSTAND_FOLDER_TITLE" = "Lehtikioski";
"NEWSSTAND_STORE_BUTTON_TITLE" = "Store";
"NEWSSTAND_NEWISSUEBADGE_TITLE" = "Uusi";

"DELETE_ICON_TITLE" = "Poista symboli";
"DELETE_ICON_BODY" = "Haluatko varmasti poistaa kirjanmerkin %@?";
"DELETE_ICON_CONFIRM" = "Poista";
"DELETE_ICON_CANCEL" = "Kumoa";

"DELETE_WIDGET_TITLE" = "Poista %@";
"DELETE_WIDGET_BODY" = "Haluatko varmasti poistaa kohteen %@?";
"DELETE_WIDGET_CONFIRM" = "Poista";
"DELETE_WIDGET_CANCEL" = "Kumoa";

"UNINSTALL_ICON_TITLE" = "Poista %@";
"UNINSTALL_ICON_TITLE_FOR_APP_WITH_DOCUMENTS_IN_CLOUD" = "Poista %@";
"UNINSTALL_ICON_TITLE_FOR_APP_WITH_DOCUMENTS_UPDATES_PENDING" = "Odotetaan päivityksiä";
"UNINSTALL_ICON_BODY" = "Ohjelman %@ poistaminen poistaa myös kaikki sen tiedot.";
"UNINSTALL_ICON_BODY_MULTIPLE" = "Ohjelman %@ poistaminen poistaa myös kohteen %@ sisältöineen.";
"UNINSTALL_ICON_BODY_FOR_APP_WITH_DOCUMENTS_IN_CLOUD" = "Ohjelman %@ poistaminen poistaa myös sen kaiken datan laitteesta %@. Kaikki iCloudiin tallennetut dokumentit ja data säilytetään ja niitä voidaan hallita Asetuksissa.";
"UNINSTALL_ICON_BODY_FOR_APP_WITH_DOCUMENTS_UPDATES_PENDING" = "iCloudissa on dokumentteja, jotka odottavat päivitystä. Nämä päivitykset menetetään, jos ”%@” poistetaan nyt.";
"UNINSTALL_ICON_CONFIRM" = "Poista";
"UNINSTALL_ICON_CANCEL" = "Kumoa";

"RATINGS_ICON_TITLE" = "Arvioi %@ ennen poistoa.";
"RATINGS_ICON_BODY" = "Arvioi napauttamalla tähteä.";
"RATINGS_ICON_SKIP" = "Ei kiitos";
"RATINGS_ICON_RATE" = "Arvioi";

"GAMECENTER_DELETE_STATS_TITLE" = "Poistetaanko ”%@” Game Centeristä?";
"GAMECENTER_DELETE_STATS_BODY" = "Sinua ei enää listata pelin ”%@” tulostaulukoissa.";
"GAMECENTER_DELETE_STATS_DELETE" = "Poista";
"GAMECENTER_DELETE_STATS_CANCEL" = "Säilytä";

"REORDER_INFO_TEXT" = "Siirry järjestelytilaan napauttamalla ja pitämällä symbolia. Lopeta painamalla Koti-painiketta.";
"REORDER_INFO_TITLE" = "Muokkaa Koti-valikkoa";
"REORDER_INFO_BODY" = "Järjestä symboleja uudelleen koskettamalla ja pitämällä jotakin symbolia, kunnes se alkaa heilua. Vedä symboli sen jälkeen haluttuun paikkaan. \nLuo uusi Koti-valikko vetämällä symboli oikeaan reunaan.\nPaina Koti-painiketta, kun olet valmis.";

"CARRIER_DEBUGGING_TITLE" = "Määritelty vianmääritystä varten";
"CARRIER_DEBUGGING_BODY" = "Tämä laite on määritetty lähettämään vianmääritystietoja Applelle.\nKaikki käyttötiedot, mukaan lukien henkilötiedot, näkyvät Applelle lähetetyissä raporteissa. Tämän ennakkoversion testaajien odotetaan lähettävän näitä tietoja.\nJos haluat työsi vuoksi poistaa käytöstä tämän toiminnon, kysy neuvoa työnantajaltasi.";

"UNHANDLED_URL_TITLE" = "Osoitetta ei tueta";
"UNHANDLED_URL_BODY" = "Tätä osoitetta ei ladattu:\n%@";

"RESTRICTED_URL_TITLE" = "Rajoitettu osoite";
"RESTRICTED_URL_BODY" = "Tätä osoitetta ei ladattu:\n%@";

"CALL_PERMISSION_ALERT_CALL" = "Soita";
"CALL_PERMISSION_ALERT_CANCEL" = "Kumoa";

"DOWNLOADING_ICON_LABEL" = "Ladataan…";
"INSTALLING_ICON_LABEL" = "Asennus…";
"PAUSED_ICON_LABEL" = "Taukotilassa";
"RESTRICTED_ICON_LABEL" = "Rajoitettu";
"WAITING_ICON_LABEL" = "Odotetaan…";

"APP_DOWNLOAD_QUEUE_ERROR" = "Lataustietoja ei voida noutaa. Ota yhteyttä iTunesilla.";

"PENDING_DOWNLOAD_REMOVED_TITLE" = "Tiedostolataukset suoritettu";
"PENDING_DOWNLOAD_REMOVED_BODY" = "Jotkin tiedostot on ladattu tietokoneen iTunesiin.";
"PENDING_DOWNLOAD_REMOVED_OK" = "OK";

"ALL_PENDING_DOWNLOADS_REMOVED_TITLE" = "Tiedostolataukset suoritettu";
"ALL_PENDING_DOWNLOADS_REMOVED_BODY" = "Kaikki tiedostot on ladattu tietokoneen iTunesiin.";
"ALL_PENDING_DOWNLOADS_REMOVED_OK" = "OK";

"ENTER_CURRENT_PASSCODE" = "Muuta pääsykoodia syöttämällä ensin nykyinen pääsykoodi.";
"ENTER_NEW_PASSCODE" = "Uusi pääsykoodi";
"CONFIRM_NEW_PASSCODE" = "Syötä uusi pääsykoodi uudelleen";
"CONFIRM_NEW_PASSCODE_MISMATCH" = "Uudet pääsykoodit eivät täsmää. %@";

"PASSCODE_ALERT_EMERGENCY" = "Hätäpuhelu";
"PASSCODE_ALERT_CANCEL" = "Kumoa";
"PASSCODE_ALERT_NEXT" = "Jatka";
"PASSCODE_ALERT_DONE" = "Tallenna";
"PASSCODE_ALERT_TITLE" = "Pääsykoodivaatimus";
"PASSCODE_ALERT_INCORRECT_PASSCODE" = "Virheellinen pääsykoodi. Syötä nykyinen pääsykoodi.";

"NON_COMPLIANT_PASSCODE_LATER" = "Myöh.";
"NON_COMPLIANT_PASSCODE_CONTINUE" = "Nyt";
"PASSCODE_REMINDER_CANCEL" = "Ei nyt";
"PASSCODE_REMINDER_CONTINUE" = "Jatka";

"AFTER_CLTM_SHUTDOWN_BODY_IPHONE" = "iPhone sammui korkean lämpötilan vuoksi.";
"AFTER_CLTM_SHUTDOWN_BODY_IPAD" = "iPad sammui korkean lämpötilan vuoksi.";
"AFTER_CLTM_SHUTDOWN_BODY_IPOD" = "iPod sammui korkean lämpötilan vuoksi.";

"IPHONE_TOO_HOT" = "Lämpötila";

"FIREWIRE_ALERT_STRING" = "Tällä lisälaitteella latausta\nei tueta";
"THERMAL_ALERT_STRING_IPHONE" = "iPhonen pitää jäähtyä ennen\nkuin voit käyttää sitä.";
"THERMAL_ALERT_STRING_IPAD" = "iPadin pitää jäähtyä ennen\nkuin voit käyttää sitä.";
"THERMAL_ALERT_STRING_IPOD" = "iPodin pitää jäähtyä ennen\nkuin voit käyttää sitä.";

"APP_PROFILE_EXPIRED_BODY" = "Ohjelmaa %@ ei voida avata, koska provisiointiprofiili on vanhentunut.";
"APP_PROFILE_EXPIRED_OK" = "OK";

"APP_PROFILE_NOT_TRUSTED_BODY" = "Haluatko varmasti avata ohjelman %@ kehittäjältä %@?";
"APP_PROFILE_NOT_TRUSTED_CONFIRM" = "Avaa";
"APP_PROFILE_NOT_TRUSTED_CANCEL" = "Lopeta";

"MULTIPLE_NEW_MESSAGE_HIDDEN_PREVIEW" = "%@ uutta tekstiviestiä";
"AWAY_MASKED_SMSES_LABEL" = "Tekstiviestit";
"AWAY_MASKED_SMS_LABEL" = "Tekstiviesti";

"SIMULATOR_CARRIER_STRING" = "Operaattori";

"PRINT_CENTER_TITLE" = "Tulostus";

"SEARCH_BAR_PLACEHOLDER" = "Etsi: %@";
"NO_SEARCH_RESULTS" = "Ei tuloksia";
"EMPTY_SEARCH_RESULT" = "(nimetön)";
"SEARCH_SUBTITLE_SEPARATOR" = " — ";
"SEARCH_WEB" = "Etsi verkosta";
"SEARCH_WIKIPEDIA" = "Etsi Wikipediasta";
"SEARCH_TOP_HIT" = "Paras osuma";

"ALL_DAY"   = "koko päivä";
"YESTERDAY" = "Eilen";
"TODAY" = "Tänään";
"TOMORROW" = "Huomenna";
"TODAY_TOMORROW_YESTERDAY_DATE_FORMAT" = "%@ %@";

"REMOTE_NOTIFICATION_NEED_IDENTITY_ALERT_TITLE" = "Käytä Push-ilmoituksia yhdistämällä iTunesiin";
"REMOTE_NOTIFICATION_NEED_IDENTITY_ALERT_BODY" = "Ohjelman ”%@” ilmoitukset voivat sisältää ilmoitusviestejä, ääniä ja symbolimerkkejä.";
"REMOTE_NOTIFICATION_NEED_IDENTITY_ALERT_DISMISS" = "OK";

"REMOTE_NOTIFICATION_PERMISSION_ALERT_TITLE" = "%@ haluaa lähettää sinulle Push-ilmoituksia";
"REMOTE_NOTIFICATION_PERMISSION_ALERT_BODY" = "Ilmoitukset voivat sisältää ilmoitusviestejä, ääniä ja symbolimerkkejä. Voit muokata niitä Asetuksissa.";
"REMOTE_NOTIFICATION_CONTENT_DOWNLOAD_AND_PUSH_PERMISSION_ALERT_TITLE" = "%@ haluaa lähettää sinulle uusia numeroita ja Push-ilmoituksia";
"REMOTE_NOTIFICATION_CONTENT_DOWNLOAD_PERMISSION_ALERT_TITLE" = "%@ haluaa lähettää sinulle uusia numeroita";
"REMOTE_NOTIFICATION_CONTENT_DOWNLOAD_ALERT_BODY" = "Uudet numerot ladataan automaattisesti, kun Wi-Fi on käytössä. Tämä voidaan määrittää Asetuksissa.";
"REMOTE_NOTIFICATION_PERMISSION_ALERT_DENY" = "Älä salli";
"REMOTE_NOTIFICATION_PERMISSION_ALERT_ALLOW" = "OK";

"REMOTE_NOTIFICATION_SYSTEMWIDE_ALERT_TITLE" = "Kun otat Push-ilmoitukset käyttöön, %@ vastaanottaa ääniä, ilmoitusviestejä ja merkkejä";
"REMOTE_NOTIFICATION_SYSTEMWIDE_ALERT_DISMISS" = "Kumoa";
"REMOTE_NOTIFICATION_SYSTEMWIDE_ALERT_SETTINGS" = "Asetukset";

"REMOTE_NOTIFICATION_SIMULATOR_NOT_SUPPORTED_NSERROR_DESCRIPTION" = "simulaattori ei tue etäilmoituksia";
"REMOTE_NOTIFICATION_ENTITLEMENT_NSERROR_DESCRIPTION" = "Ohjelmalle ei löytynyt valtuuttavaa %@-merkkijonoa";

"BACKGROUND_CONTINUATION_PERMISSION_ALERT_TITLE" = "%@ haluaa ajaa taustalla";
"BACKGROUND_CONTINUATION_PERMISSION_ALERT_BODY" = "Ohjelman %@ ajaminen taustalla voidaan määritellä Asetuksissa.";
"BACKGROUND_CONTINUATION_PERMISSION_ALERT_DENY" = "Älä salli";
"BACKGROUND_CONTINUATION_PERMISSION_ALERT_ALLOW" = "OK";

"BATTERY_CHARGE_PERCENTAGE" = "%@ ladattu"; 

"INTERNET_TETHERING_SINGLE_HOST" = "Oma yhteyspiste: 1 yhteys";
"INTERNET_TETHERING_MULTIPLE_HOSTS" = "Oma yhteyspiste: %@ yhteyttä";

"CLASS_0_ALERT_MESSAGE_FROM" = "Viesti henkilöltä %@:";

"APPLICATION_SWITCHER_TITLE" = "Ohjelmat";
"APPLICATION_SWITCHER_CANCEL" = "Kumoa";
"APPLICATION_SWITCHER_QUITAPP" = "Lopeta";

"DATA_PLAN_LATER" = "Myöhemmin";
"DATA_PLAN_NOW" = "Nyt";

"DATA_PLAN_NEW_ACCOUNT_TITLE" = "Mobiilidatatili";
"DATA_PLAN_NEW_ACCOUNT_BODY" = "Et ole vielä ottanut käyttöösi matkapuhelindatapalveluja. Haluatko ottaa uuden tilin käyttöön? Jos et, voit tehdä sen myöhemmin Asetuksissa.";

"DATA_PLAN_DISABLE_TITLE" = "Mobiilidata";
"DATA_PLAN_DISABLE_BODY" = "Jos et halua, että sinulta kysytään mobiilidatapalvelusta, voit kytkeä mobiilidatan pois päältä Asetuksissa.";

"DATA_PLAN_ADD_TITLE" = "Mobiilidatapalvelun käyttö";
"DATA_PLAN_ADD_LOW_BODY" = "Matkapuhelindatapalveluista on jäljellä %@. Haluatko lisätä dataa palveluusi nyt? Jos et lisää nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_MULTIPLE_DAYS" = "Matkapuhelindatapalvelut vanhenevat %@ päivän kuluttua. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_ONE_DAY" = "Matkapuhelindatapalvelut vanhenevat päivän kuluttua. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_LESS_THAN_MULTIPLE_DAYS" = "Matkapuhelindatapalvelut vanhenemiseen on vähemmän kuin %@ päivää. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_MULTIPLE_HOURS" = "Matkapuhelindatapalvelut vanhenevat noin %@ tunnin kuluttua. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_ONE_HOUR" = "Matkapuhelindatapalvelut vanhenevat noin tunnin kuluttua. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EXPIRATION_BODY_MULTIPLE_MINUTES" = "Matkapuhelindatapalvelut vanhenevat noin %@ minuutin kuluttua. Haluatko jatkaa palvelua nyt? Jos et tee niin nyt, voit tehdä sen myöhemmin Asetuksissa.";
"DATA_PLAN_ADD_EMPTY_BODY" = "Nykyiset matkapuhelindatapalvelut on käytetty loppuun. Haluatko lisätä dataa palveluihin nyt? Jos et lisää nyt, voit tehdä sen myöhemmin Asetuksissa.";

"DATA_PLAN_ACTIVATED_TITLE" = "Matkapuhelindatapalvelut aktivoitu";
"DATA_PLAN_ACTIVATED_FORMAT" = "%@-mobiilidatapalvelujen aktivointi onnistui.";

"DATA_PLAN_UPDATED_TITLE" = "Mobiilidatapalvelu päivitetty";
"DATA_PLAN_UPDATED_FORMAT" = "%@-mobiilidatapalvelujen päivitys onnistui.";

"DATA_PLAN_FAILED_TITLE" = "Matkapuhelindatapalvelujen aktivointivirhe";
"DATA_PLAN_FAILED_ACTIVATE_FORMAT" = "%@-mobiilidatapalvelujen aktivointi ei onnistunut.";
"DATA_PLAN_FAILED_UPDATE_FORMAT" = "%@-mobiilidatapalvelujen päivitys ei onnistunut.";

"DATA_PLAN_FAILED_TRY_LATER" = "Kumoa";
"DATA_PLAN_FAILED_TRY_AGAIN" = "Uudelleen";

"ORIENTATION_LOCK_PORTRAIT_LOCKED" = "Pystysuunta lukittu";
"ORIENTATION_LOCK_PORTRAIT_UNLOCKED" = "Pystysuunnan lukitus avattu";
"ORIENTATION_LOCK_LANDSCAPE_LOCKED" = "Vaakasuunta lukittu";
"ORIENTATION_LOCK_UNLOCKED" = "Suunnan lukitus avattu";

"MUTE_ON" = "Mykistetty";
"MUTE_OFF" = "Mykistys pois päältä";

/* format string for alarms on events in other time zones - #1 is main time string, #2 is time in other time zone (e.g. 'Today at 1:00 pm (4:00 pm EDT)')*/
"ALARM_OTHER_TIMEZONE_FORMAT" = "%1$@ (%2$@)";

"IBOOKS_UNSUPPORTED_TITLE" = "iBooks-päivitys";
"IBOOKS_UNSUPPORTED_BODY" = "Lataa ilmainen päivitys App Storesta.";
"IBOOKS_UNSUPPORTED_DOWNLOAD" = "Lataa";
"IBOOKS_UNSUPPORTED_CANCEL" = "Kumoa";

"BULLETIN_LIST_DONE" = "Valmis";
"BULLETIN_LIST_CLEAR" = "Tyhjennä";
"BULLETIN_LIST_NO_NEW_NOTIFICATIONS" = "Ei uusia ilmoituksia";

"SYNCING_ICON_LABEL" = "Synkronoidaan…";
"CLEANING_ICON_LABEL" = "Viimeistellään…";

// Software Update Alerts
"SOFTWARE_UPDATE_AVAILABLE_ALERT_TITLE"  = "Ohjelmiston päivitys";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_BODY"   = "%@ on nyt saatavilla.";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_BODY_IPHONE" = "%@ on nyt saatavilla iPhonelle.";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_BODY_IPAD" = "%@ on saatavilla iPadille.";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_BODY_IPOD" = "%@ on nyt saatavilla iPodille.";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_CANCEL" = "Sulje";
"SOFTWARE_UPDATE_AVAILABLE_ALERT_ACTION" = "Lisätietoja";

"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_TITLE"      = "Ohjelmiston päivitys";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_PLURAL"          = "%@ asennetaan %@ sekunnin kuluttua. Laite käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_SINGULAR"        = "%@ asennetaan %@ sekunnin kuluttua. Laite käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_PLURAL_IPHONE"   = "%@ asennetaan %@ sekunnin kuluttua. iPhone käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_SINGULAR_IPHONE" = "%@ asennetaan %@ sekunnin kuluttua. iPhone käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_PLURAL_IPAD"     = "%@ asennetaan %@ sekunnin kuluttua. iPad käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_SINGULAR_IPAD"   = "%@ asennetaan %@ sekunnin kuluttua. iPad käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_PLURAL_IPOD"     = "%@ asennetaan %@ sekunnin kuluttua. iPod käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_BODY_SINGULAR_IPOD"   = "%@ asennetaan %@ sekunnin kuluttua. iPod käynnistyy uudelleen, kun asennus on suoritettu.";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_CANCEL"     = "Myöhemmin";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_ACTION"     = "Asenna";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_LOCK_LABEL" = "odota";
"SOFTWARE_UPDATE_FORCED_INSTALL_ALERT_LOCK_LABEL_SHORT" = "odota";

"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_ALERT_TITLE"        = "Ohjelmistopäivitys epäonnistui";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_ALERT_BODY_GENERIC" = "Virhe ladattaessa päivitystä %@.";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_ALERT_CANCEL"       = "Sulje";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_ALERT_ACTION"       = "Asetukset";

"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_STORAGE_ALERT_TITLE"  = "Päivitystä ei voida ladata";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_STORAGE_ALERT_BODY"   = "Ei riittävästi tallennustilaa tiedoston %@ lataamista varten. Voit hallita tallennustilaa Asetuksissa.";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_STORAGE_ALERT_CANCEL" = "Sulje";
"SOFTWARE_UPDATE_DOWNLOAD_FAILURE_STORAGE_ALERT_ACTION" = "Asetukset";

"SOFTWARE_UPDATE_INSTALL_FAILURE_UNAVAILABLE_TITLE"  = "Ohjelmistopäivitys ei saatavilla";
"SOFTWARE_UPDATE_INSTALL_FAILURE_UNAVAILABLE_BODY"   = "Ohjelmistopäivitys ei ole nyt saatavilla. Yritä myöhemmin uudelleen.";
"SOFTWARE_UPDATE_INSTALL_FAILURE_ALERT_TITLE"        = "Päivitystä ei voida asentaa";
"SOFTWARE_UPDATE_INSTALL_FAILURE_GENERIC_ALERT_BODY" = "Virhe asennettaessa kohdetta %@.";
"SOFTWARE_UPDATE_INSTALL_FAILURE_BATTERY_ALERT_BODY" = "Ohjemistopäivitys vaatii vähintään %@ akun varaustason tai laitteen tulee olla liitettynä virtalähteeseen.";
"SOFTWARE_UPDATE_INSTALL_FAILURE_STORAGE_ALERT_BODY" = "Ohjelmistopäivitys vaatii vähintään %@ käytettävissä olevaa tallennustilaa.";
"SOFTWARE_UPDATE_INSTALL_FAILURE_NETWORK_ALERT_BODY" = "Ohjelmistopäivitys vaatii verkkoyhteyden.";
"SOFTWARE_UPDATE_INSTALL_FAILURE_ALERT_CANCEL"       = "Sulje";
"SOFTWARE_UPDATE_INSTALL_FAILURE_ALERT_ACTION"       = "Asetukset";

"SOFTWARE_UPDATE_VERIFYING_ALERT_BODY" = "Varmistetaan päivitystä…";

"SOFTWARE_UPDATE_VERIFICATION_FAILED_ALERT_TITLE"  = "Päivitystä ei voida varmistaa";
"SOFTWARE_UPDATE_VERIFICATION_FAILED_ALERT_BODY"   = "Päivityksen %@ varmistus epäonnistui, koska et ole yhteydessä internetiin.";
"SOFTWARE_UPDATE_VERIFICATION_FAILED_ALERT_CANCEL" = "Sulje";
"SOFTWARE_UPDATE_VERIFICATION_FAILED_ALERT_ACTION" = "Yritä uudelleen";

// Newsstand card icon
"NEWSSTAND_CARD_TEXT" = "Voit ladata aikakaus- ja sanomalehtiä App Storesta";

// Relative date strings
"RELATIVE_DATE_FUTURE_SEC"  = "%@ s";
"RELATIVE_DATE_FUTURE_MIN"  = "%@ min";
"RELATIVE_DATE_FUTURE_HOUR" = "%@ t";
"RELATIVE_DATE_NOW"         = "nyt";
"RELATIVE_DATE_PAST_SEC"    = "%@ s sitten";
"RELATIVE_DATE_PAST_MIN"    = "%@ min sitten";
"RELATIVE_DATE_PAST_HOUR"   = "%@ t sitten";
"RELATIVE_DATE_PAST_DAY"    = "%@ pv sitten";
